modules/catalyst/tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/0.orig/bottomWater/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/bottomWater";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform 300;
    }
    maxX
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    minY
    {
        type            zeroGradient;
        value           uniform 300;
    }
    minZ
    {
        type            zeroGradient;
        value           uniform 300;
    }
    maxZ
    {
        type            zeroGradient;
        value           uniform 300;
    }
    bottomWater_to_rightSolid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
    bottomWater_to_leftSolid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
    bottomWater_to_heater
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
}


// ************************************************************************* //
